---
kind: method
id: M:Autodesk.Revit.DB.CurtainGridSet.#ctor
source: html/b3386138-4473-31f7-ad5a-8e2b8a1d6667.htm
---
# Autodesk.Revit.DB.CurtainGridSet.#ctor Method

Initializes a new instance of the CurtainGridSet class

## Syntax (C#)
```csharp
public CurtainGridSet()
```